In [5]:
import pandas as pd
import ydata_profiling
from pandas_profiling import ProfileReport
df = pd.read_csv('lotok.csv')
df.head(3)

,Unnamed: 0,Concurso,Data,Bola1,Bola2,Bola3,Bola4,Bola5,Bola6,Bola7,...,Bola10,Bola11,Bola12,Bola13,Bola14,Bola15,G15_Num,G14_num,Val15,Val14
0,0,1.0,29/09/2003,18.0,20.0,25.0,23.0,10.0,11.0,24.0,...,2.0,13.0,9.0,5.0,16.0,3.0,5.0,154.0,"49.765,82",689
1,1,2.0,06/10/2003,23.0,15.0,5.0,4.0,12.0,16.0,20.0,...,19.0,24.0,1.0,9.0,13.0,7.0,1.0,184.0,"596.323,70","1.388,00"
2,2,3.0,13/10/2003,20.0,23.0,12.0,8.0,6.0,1.0,7.0,...,4.0,16.0,10.0,9.0,17.0,24.0,2.0,158.0,"400.623,70","2.173,00"

In [6]:
profile = ProfileReport(df)
profile.to_file("profile.html")

Summarize dataset: 100%|██████████████████████████████████████████████████| 392/392 [00:25<00:00, 15.16it/s, Completed]
Generate report structure: 100%|█████████████████████████████████████████████████████████| 1/1 [00:02<00:00,  2.94s/it]
Render HTML: 100%|███████████████████████████████████████████████████████████████████████| 1/1 [00:05<00:00,  5.51s/it]
Export report to file: 100%|█████████████████████████████████████████████████████████████| 1/1 [00:00<00:00,  2.24it/s]

In [7]:
df.shape

(1910, 22)

In [8]:
vrp = df['Concurso']
display(vrp)

0          1.0
1          2.0
2          3.0
3          4.0
4          5.0
         ...
1905    1906.0
1906    1907.0
1907    1908.0
1908    1909.0
1909    1910.0
Name: Concurso, Length: 1910, dtype: float64

In [50]:
df.dtypes

Unnamed: 0      int64
Concurso      float64
Data           object
Bola1         float64
Bola2         float64
Bola3         float64
Bola4         float64
Bola5         float64
Bola6         float64
Bola7         float64
Bola8         float64
Bola9         float64
Bola10        float64
Bola11        float64
Bola12        float64
Bola13        float64
Bola14        float64
Bola15        float64
G15_Num       float64
G14_num       float64
Val15          object
Val14          object
dtype: object

In [51]:
df.axes

[RangeIndex(start=0, stop=1910, step=1),
 Index(['Unnamed: 0', 'Concurso', 'Data ', 'Bola1', 'Bola2', 'Bola3', 'Bola4',
        'Bola5', 'Bola6', 'Bola7', 'Bola8', 'Bola9', 'Bola10', 'Bola11',
        'Bola12', 'Bola13', 'Bola14', 'Bola15', 'G15_Num', 'G14_num', 'Val15',
        'Val14'],
       dtype='object')]

In [52]:
 df['Concurso'].head() # ler as rows das duas colunas

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: Concurso, dtype: float64

In [53]:
df.index

RangeIndex(start=0, stop=1910, step=1)

In [54]:
 df['G15_Num']

0       5.0
1       1.0
2       2.0
3       1.0
4       2.0
       ...
1905    3.0
1906    4.0
1907    3.0
1908    1.0
1909    3.0
Name: G15_Num, Length: 1910, dtype: float64

In [55]:
 df['Val15']

0          49.765,82
1         596.323,70
2         400.623,70
3         902.226,02
4         380.017,55
            ...
1905      932.249,54
1906      408.154,57
1907      530.770,32
1908    2.130.630,60
1909      565.404,78
Name: Val15, Length: 1910, dtype: object

In [56]:
 df['Val14']

0            689
1       1.388,00
2       2.173,00
3       1.498,00
4            687
          ...
1905    2.189,00
1906         897
1907    1.576,00
1908    1.939,00
1909    1.453,00
Name: Val14, Length: 1910, dtype: object

In [57]:
df['G14_num']

0       154.0
1       184.0
2       158.0
3       258.0
4       472.0
        ...
1905    393.0
1906    800.0
1907    444.0
1908    338.0
1909    513.0
Name: G14_num, Length: 1910, dtype: float64

In [58]:
df.loc[0]

Unnamed: 0             0
Concurso             1.0
Data          29/09/2003
Bola1               18.0
Bola2               20.0
Bola3               25.0
Bola4               23.0
Bola5               10.0
Bola6               11.0
Bola7               24.0
Bola8               14.0
Bola9                6.0
Bola10               2.0
Bola11              13.0
Bola12               9.0
Bola13               5.0
Bola14              16.0
Bola15               3.0
G15_Num              5.0
G14_num            154.0
Val15          49.765,82
Val14                689
Name: 0, dtype: object

In [59]:
df.loc[0:2]

,Unnamed: 0,Concurso,Data,Bola1,Bola2,Bola3,Bola4,Bola5,Bola6,Bola7,...,Bola10,Bola11,Bola12,Bola13,Bola14,Bola15,G15_Num,G14_num,Val15,Val14
0,0,1.0,29/09/2003,18.0,20.0,25.0,23.0,10.0,11.0,24.0,...,2.0,13.0,9.0,5.0,16.0,3.0,5.0,154.0,"49.765,82",689
1,1,2.0,06/10/2003,23.0,15.0,5.0,4.0,12.0,16.0,20.0,...,19.0,24.0,1.0,9.0,13.0,7.0,1.0,184.0,"596.323,70","1.388,00"
2,2,3.0,13/10/2003,20.0,23.0,12.0,8.0,6.0,1.0,7.0,...,4.0,16.0,10.0,9.0,17.0,24.0,2.0,158.0,"400.623,70","2.173,00"

In [60]:
df.loc[1909]

Unnamed: 0          7772
Concurso          1910.0
Data          30/12/2019
Bola1               22.0
Bola2                3.0
Bola3                9.0
Bola4               14.0
Bola5               15.0
Bola6                4.0
Bola7               16.0
Bola8                2.0
Bola9                7.0
Bola10              18.0
Bola11              10.0
Bola12              23.0
Bola13              13.0
Bola14              25.0
Bola15              12.0
G15_Num              3.0
G14_num            513.0
Val15         565.404,78
Val14           1.453,00
Name: 1909, dtype: object

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1910 entries, 0 to 1909
Data columns (total 22 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1910 non-null   int64
 1   Concurso    1910 non-null   float64
 2   Data        1910 non-null   object
 3   Bola1       1910 non-null   float64
 4   Bola2       1910 non-null   float64
 5   Bola3       1910 non-null   float64
 6   Bola4       1910 non-null   float64
 7   Bola5       1910 non-null   float64
 8   Bola6       1910 non-null   float64
 9   Bola7       1910 non-null   float64
 10  Bola8       1910 non-null   float64
 11  Bola9       1910 non-null   float64
 12  Bola10      1910 non-null   float64
 13  Bola11      1910 non-null   float64
 14  Bola12      1910 non-null   float64
 15  Bola13      1910 non-null   float64
 16  Bola14      1910 non-null   float64
 17  Bola15      1910 non-null   float64
 18  G15_Num     1910 non-null   float64
 19  G14_num     1910 non-null   float64
 20  Val15       1910 non-null   object
 21  Val14       1910 non-null   object
dtypes: float64(18), int64(1), object(3)
memory usage: 328.4+ KB

In [66]:
df.columns

Index(['Unnamed: 0', 'Concurso', 'Data ', 'Bola1', 'Bola2', 'Bola3', 'Bola4',
       'Bola5', 'Bola6', 'Bola7', 'Bola8', 'Bola9', 'Bola10', 'Bola11',
       'Bola12', 'Bola13', 'Bola14', 'Bola15', 'G15_Num', 'G14_num', 'Val15',
       'Val14', 'FLAG'],
      dtype='object')

In [67]:
df['FLAG'] = 0 # Cria a coluna FLAG

In [68]:
for index, row in df.iterrows():    # Ativa FLAG para 1 ocorrencias Bola1
    if row['Bola1'] == 1:
        df.loc[index,'FLAG'] = 1

In [73]:
acbol = df[df['Bola1'] == 1].sum() # Lista FLAG = 1
actot = acbol
display(actot)

Unnamed: 0                                               369389
Concurso                                                88817.0
Data          08/03/200426/04/200412/07/200402/08/200409/05/...
Bola1                                                      95.0
Bola2                                                    1249.0
Bola3                                                    1231.0
Bola4                                                    1334.0
Bola5                                                    1244.0
Bola6                                                    1218.0
Bola7                                                    1448.0
Bola8                                                    1218.0
Bola9                                                    1339.0
Bola10                                                   1380.0
Bola11                                                   1255.0
Bola12                                                   1359.0
Bola13                                                   1114.0
Bola14                                                   1316.0
Bola15                                                   1349.0
G15_Num                                                   334.0
G14_num                                                 54673.0
Val15         662.295,89503.451,701.731.431,15731.525,8886.4...
Val14         9702.589,002.114,009414851.750,001.944,001.427...
FLAG                                                         95
dtype: object

In [74]:
for index, row in df.iterrows(): # Ativa FLAG para 1 ocorrencias Bola2
    if row['Bola2'] == 1:
        df.loc[index,'FLAG'] = 1

In [75]:
acbol = df[df['Bola2'] == 1].sum() # Lista FLAG = 1
actot = actot + acbol
display(actot)

Unnamed: 0                                               721595
Concurso                                               173645.0
Data          08/03/200426/04/200412/07/200402/08/200409/05/...
Bola1                                                    1188.0
Bola2                                                    1336.0
Bola3                                                    2500.0
Bola4                                                    2544.0
Bola5                                                    2440.0
Bola6                                                    2317.0
Bola7                                                    2685.0
Bola8                                                    2442.0
Bola9                                                    2450.0
Bola10                                                   2470.0
Bola11                                                   2424.0
Bola12                                                   2524.0
Bola13                                                   2351.0
Bola14                                                   2566.0
Bola15                                                   2602.0
G15_Num                                                   672.0
G14_num                                                117623.0
Val15         662.295,89503.451,701.731.431,15731.525,8886.4...
Val14         9702.589,002.114,009414851.750,001.944,001.427...
FLAG                                                        182
dtype: object

In [76]:
for index, row in df.iterrows(): # Ativa FLAG para 1 ocorrencias Bola2
    if row['Bola3'] == 1:
        df.loc[index,'FLAG'] = 1

In [77]:
acbol = df[df['Bola3'] == 1].sum() # Lista FLAG = 1
actot = actot + acbol
display(actot)

Unnamed: 0                                              1035113
Concurso                                               248916.0
Data          08/03/200426/04/200412/07/200402/08/200409/05/...
Bola1                                                    2290.0
Bola2                                                    2367.0
Bola3                                                    2578.0
Bola4                                                    3559.0
Bola5                                                    3415.0
Bola6                                                    3371.0
Bola7                                                    3740.0
Bola8                                                    3559.0
Bola9                                                    3661.0
Bola10                                                   3475.0
Bola11                                                   3487.0
Bola12                                                   3581.0
Bola13                                                   3473.0
Bola14                                                   3537.0
Bola15                                                   3759.0
G15_Num                                                   975.0
G14_num                                                166738.0
Val15         662.295,89503.451,701.731.431,15731.525,8886.4...
Val14         9702.589,002.114,009414851.750,001.944,001.427...
FLAG                                                        260
dtype: object

In [79]:
df.columns

Index(['Unnamed: 0', 'Concurso', 'Data ', 'Bola1', 'Bola2', 'Bola3', 'Bola4',
       'Bola5', 'Bola6', 'Bola7', 'Bola8', 'Bola9', 'Bola10', 'Bola11',
       'Bola12', 'Bola13', 'Bola14', 'Bola15', 'G15_Num', 'G14_num', 'Val15',
       'Val14', 'FLAG'],
      dtype='object')